# Путь к папке игры
MENU_FILE_PATH = "C:\Games\WarThunder"

# Фразы для замены
REPLACE_PHRASES = {
    "В бой": "В боль",
    "уничтожен": "анигилирован",
    "Уничтожен": "Анигилирован",
    "Критические повреждения": "Критинизм",
    "аркадные": "пивные",
    "Пожар": "Горит жопа",
    "Не пробил": "Не пломбир",
    "Попадание": "Впопудание",
    "Рикошет": "Хуета",
    "Взрыв боекомплекта": "Подрыв очка",
    "Экипаж выведен из строя": "Экипаж подох",
    "Боевой пропуск": "Пивной попуск",
    "Взрыв топливных баков": "Соляра бахнула",
    "Снаряд не взвёлся": "Картон танкует",
    "Снаряд разрушился": "Он испарился!",
    "Временно неуязвим": "Ебучий инвул",
    "Максимальная скорость заднего хода.": "Максимальная Француская скорость.",
    "Техника анигилирована": "Анигилирован",
    "Помощь в анигилировании противника": "Помогатор",
    "Самолёт сбит": "Долетался дружок",
    "Вертолёт сбит": "Заебали эти гниды",
    # Добавьте остальные фразы по аналогии
    # Регистр имеет значение!
}

REPLACE_ENCYCLOPEDIA = {
    "Во время боя нажмите F1, чтобы посмотреть помощь по управлению.": "Наша миссия - терпеть!",
    "Почаще заглядывайте в Энциклопедию. Там много полезной информации.": "Терпим, но не жалуемся."
}
